{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": {
    "base_model_class": "BradleyTerryRewardModel",
    "parent_library": "__main__"
  },
  "base_model_name_or_path": null,
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.18.1",
  "qalora_group_size": 16,
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "language_model.layers.19.self_attn.o_proj",
    "visual.blocks.20.mlp.linear_fc2",
    "language_model.layers.25.self_attn.v_proj",
    "visual.blocks.22.mlp.linear_fc1",
    "visual.blocks.22.attn.qkv",
    "language_model.layers.16.self_attn.q_proj",
    "visual.blocks.13.attn.qkv",
    "language_model.layers.19.self_attn.q_proj",
    "language_model.layers.14.self_attn.q_proj",
    "visual.blocks.21.mlp.linear_fc2",
    "visual.blocks.23.mlp.linear_fc2",
    "visual.blocks.14.mlp.linear_fc1",
    "language_model.layers.18.self_attn.o_proj",
    "language_model.layers.15.self_attn.o_proj",
    "language_model.layers.26.self_attn.k_proj",
    "visual.blocks.16.mlp.linear_fc2",
    "language_model.layers.24.self_attn.o_proj",
    "visual.blocks.14.attn.proj",
    "language_model.layers.22.self_attn.k_proj",
    "language_model.layers.20.self_attn.v_proj",
    "visual.blocks.12.mlp.linear_fc2",
    "language_model.layers.23.self_attn.q_proj",
    "visual.blocks.12.mlp.linear_fc1",
    "language_model.layers.16.self_attn.v_proj",
    "language_model.layers.24.self_attn.k_proj",
    "visual.blocks.19.attn.proj",
    "language_model.layers.16.self_attn.o_proj",
    "language_model.layers.21.self_attn.o_proj",
    "visual.blocks.15.attn.qkv",
    "language_model.layers.27.self_attn.q_proj",
    "language_model.layers.20.self_attn.o_proj",
    "visual.blocks.22.attn.proj",
    "language_model.layers.27.self_attn.k_proj",
    "language_model.layers.20.self_attn.q_proj",
    "language_model.layers.23.self_attn.k_proj",
    "visual.blocks.20.mlp.linear_fc1",
    "visual.blocks.18.attn.qkv",
    "visual.blocks.13.attn.proj",
    "language_model.layers.20.self_attn.k_proj",
    "visual.blocks.20.attn.proj",
    "language_model.layers.25.self_attn.o_proj",
    "language_model.layers.25.self_attn.k_proj",
    "visual.blocks.18.attn.proj",
    "visual.blocks.12.attn.qkv",
    "visual.blocks.15.mlp.linear_fc1",
    "language_model.layers.27.self_attn.o_proj",
    "visual.blocks.13.mlp.linear_fc1",
    "language_model.layers.17.self_attn.q_proj",
    "language_model.layers.15.self_attn.v_proj",
    "language_model.layers.14.self_attn.o_proj",
    "visual.blocks.12.attn.proj",
    "language_model.layers.19.self_attn.v_proj",
    "visual.blocks.18.mlp.linear_fc1",
    "visual.blocks.23.mlp.linear_fc1",
    "visual.blocks.18.mlp.linear_fc2",
    "language_model.layers.15.self_attn.q_proj",
    "visual.blocks.14.mlp.linear_fc2",
    "language_model.layers.14.self_attn.k_proj",
    "visual.blocks.16.attn.proj",
    "language_model.layers.22.self_attn.o_proj",
    "language_model.layers.18.self_attn.k_proj",
    "language_model.layers.18.self_attn.q_proj",
    "language_model.layers.17.self_attn.v_proj",
    "visual.blocks.23.attn.qkv",
    "language_model.layers.24.self_attn.v_proj",
    "visual.blocks.21.mlp.linear_fc1",
    "visual.blocks.15.mlp.linear_fc2",
    "visual.blocks.17.attn.proj",
    "language_model.layers.19.self_attn.k_proj",
    "visual.blocks.17.mlp.linear_fc1",
    "language_model.layers.24.self_attn.q_proj",
    "visual.blocks.17.attn.qkv",
    "language_model.layers.27.self_attn.v_proj",
    "language_model.layers.21.self_attn.v_proj",
    "visual.blocks.16.attn.qkv",
    "language_model.layers.23.self_attn.v_proj",
    "language_model.layers.26.self_attn.v_proj",
    "language_model.layers.22.self_attn.q_proj",
    "language_model.layers.21.self_attn.q_proj",
    "language_model.layers.17.self_attn.k_proj",
    "visual.blocks.19.mlp.linear_fc2",
    "language_model.layers.22.self_attn.v_proj",
    "visual.blocks.21.attn.qkv",
    "language_model.layers.18.self_attn.v_proj",
    "language_model.layers.16.self_attn.k_proj",
    "visual.blocks.13.mlp.linear_fc2",
    "language_model.layers.26.self_attn.q_proj",
    "visual.blocks.16.mlp.linear_fc1",
    "language_model.layers.14.self_attn.v_proj",
    "language_model.layers.17.self_attn.o_proj",
    "visual.blocks.20.attn.qkv",
    "visual.blocks.23.attn.proj",
    "visual.blocks.17.mlp.linear_fc2",
    "language_model.layers.23.self_attn.o_proj",
    "visual.blocks.14.attn.qkv",
    "language_model.layers.26.self_attn.o_proj",
    "visual.blocks.19.attn.qkv",
    "language_model.layers.25.self_attn.q_proj",
    "visual.blocks.21.attn.proj",
    "visual.blocks.22.mlp.linear_fc2",
    "language_model.layers.21.self_attn.k_proj",
    "visual.blocks.15.attn.proj",
    "visual.blocks.19.mlp.linear_fc1",
    "language_model.layers.15.self_attn.k_proj"
  ],
  "target_parameters": null,
  "task_type": null,
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}